app/views/users/show.html.erb

SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 4]]
---
    <div class="col-md-8">
        <% if @user.microposts.any? %>
            <h3>Microposts (<%=@user.microposts.count %>)</h3>