app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "tao dang dang test nhe\r\n"], ["user_id", 4], ["created_at", "2020-12-24 13:19:43.052215"], ["updated_at", "2020-12-24 13:19:43.052215"]]
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "tu nhien mat mang"], ["user_id", 4], ["created_at", "2020-12-24 14:09:54.691712"], ["updated_at", "2020-12-24 14:09:54.691712"]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 4]]
---
    def create
        @micropost = current_user.microposts.build(micropost_params)
        @micropost.image.attach(params[:micropost][:image])
        if @micropost.save
            flash[:success] = "Micropost created!"
            redirect_to root_url

        else
            @feed_items = current_user.feed.paginate(page: params[:page])