app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 4]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "nhung05"], ["email", "nhung05@gmail.com"], ["password_digest", "$2a$12$07I9HthsbKr5GNam9nXiTOyQr.fjK87p6JlEcIsmUnFfs4B9ezfGG"], ["updated_at", "2020-12-22 12:02:35.994033"], ["id", 2]]